Question 1

Five functions of the pandas library with execution:
- read_csv(): Used to load data from a CSV file to a pandas dataframe.
Execution: `pd.read_csv('example.csv')`
- head(): Used to return top n (by default 5) values of data frame or series. Execution: `df.head()`
- tail(): Used to return last n (by default 5) values of data frame or series. Execution: `df.tail()`
- dtypes(): Used to return a series with the data type of each column. Execution: `df.dtypes`
- describe(): calculate summery statistics for a series or dataframe. Execution: `df.describe()`

Question 2

In [5]:
import pandas as pd
df = {'A': [1,2,3], 'B': [10,20,30], 'C': [100,200,300]} # make dataframe with columns A,B and C

In [6]:
pd.DataFrame(df)

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300

In [10]:
def reindex(df): # define a function
    new_index = range(1,6,2)  # make index starts from 1 and increments by 2 for each raw
    idx = pd.Index(new_index)  # change index with new index
    df_reindex = pd.DataFrame(df, index=idx) # give new index to data
    return df_reindex
reindex(df)

   A   B    C
1  1  10  100
3  2  20  200
5  3  30  300

Question 3

In [11]:
import pandas as pd
data = {'Values': [10,20,30,40,50]}  # create data
df =pd.DataFrame(data)  # dataframe of data
def cal_sum(df):  # create function
    sum_value = df['Values'][:3].sum()  # to calculate sum of first three values
    return print(f'sum of first 3 values is {sum_value}')
cal_sum(df)

sum of first 3 values is 60

Question 4

In [12]:
Data = {'Text': ['I am learning data science', 'right now i am learning pandas library', 'pandas is such a wonderfull library']}  # give data
df = pd.DataFrame(Data)  # make dataframe as df

In [13]:
def word_count_text(df): # create function
    df['Word_Count'] = df['Text'].apply(lambda x: len(str(x).split()))  # make new column which count number of words in text column
word_count_text(df) # call function
pd.DataFrame(df) # to print dataframe of new data

                                     Text  Word_Count
0              I am learning data science           5
1  right now i am learning pandas library           7
2     pandas is such a wonderfull library           6

Question 5

DataFrame.size is an attribute that returns the total number of elements in DtaFrame while, DtaFrame.shape returns a tuple representing dimentions of the data frame.

DataFrame.size represents the product of the number of raws and columns in the dataframe. while, DataFrame.shape provides the number of rows and columns in the DataFrame.

DataFrame.size returns single integer value. while, DataFrame.shape returns a tuple of two integers, where the first element is the number of rows and the second element is the number of columns.

Question 6

we use `pandas.read_excel('example.xlsx')` function to read an excel file.

Question 7

In [14]:
df = pd.DataFrame({'Email': ['john@gmail.com', 'elon@twitter.com', 'jerry@yahoo.com']})  # create dataframe df
df['Username']=df['Email'].apply(lambda x: x.split('@')[0]) # create new column which split with @ and print username
df # print df

              Email Username
0    john@gmail.com     john
1  elon@twitter.com     elon
2   jerry@yahoo.com    jerry

Question 8

In [15]:
df = pd.DataFrame({'A':[3,8,6,2,9], 'B':[5,2,9,3,1], 'C':[1,7,4,5,2]}) # create dataframe df
df # to print original datafrme

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [16]:
df2 = df[(df['A']>5) & (df['B']<10)]  # create dataframe with conditions on A and B column
df2 # return new dataframe

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Question 9

In [17]:
df = pd.DataFrame({'Values': [2,4,6,6,8,2,6,9,3,1,5,7]}) #create dataframe df
df

    Values
0        2
1        4
2        6
3        6
4        8
5        2
6        6
7        9
8        3
9        1
10       5
11       7

In [18]:
df.mean() # to calculate mean

Values    4.916667
dtype: float64

In [19]:
df.median() # to calculate median

Values    5.5
dtype: float64

In [20]:
df.std() # to calcullate standard deviation

Values    2.539088
dtype: float64

Question 10

In [36]:
df = pd.DataFrame({
    'Date': pd.date_range(start='2024-01-21', periods=12),
    'Sales': [10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65]
}) # create a dataframe
df

         Date  Sales
0  2024-01-21     10
1  2024-01-22     15
2  2024-01-23     20
3  2024-01-24     25
4  2024-01-25     30
5  2024-01-26     35
6  2024-01-27     40
7  2024-01-28     45
8  2024-01-29     50
9  2024-01-30     55
10 2024-01-31     60
11 2024-02-01     65

In [37]:
def cal_moving_average(df, window_size=7): # define a function with window size 7
    df['MovingAverage'] = df['Sales'].rolling(window=window_size, min_periods=1).mean() # used rolling function along with mean to calculate moving average
cal_moving_average(df)
df

         Date  Sales  MovingAverage
0  2024-01-21     10           10.0
1  2024-01-22     15           12.5
2  2024-01-23     20           15.0
3  2024-01-24     25           17.5
4  2024-01-25     30           20.0
5  2024-01-26     35           22.5
6  2024-01-27     40           25.0
7  2024-01-28     45           30.0
8  2024-01-29     50           35.0
9  2024-01-30     55           40.0
10 2024-01-31     60           45.0
11 2024-02-01     65           50.0

Question 11

In [41]:
df = pd.DataFrame({'Date': pd.date_range(start='2024-01-21', periods=12)}) # create data frame of date

In [44]:
def weekday_col(df): # define a function
    df['Weekday'] = df['Date'].dt.day_name() # create new column weekday containing day name
weekday_col(df) # call a function
df # to print modified dataframe

         Date    Weekday
0  2024-01-21     Sunday
1  2024-01-22     Monday
2  2024-01-23    Tuesday
3  2024-01-24  Wednesday
4  2024-01-25   Thursday
5  2024-01-26     Friday
6  2024-01-27   Saturday
7  2024-01-28     Sunday
8  2024-01-29     Monday
9  2024-01-30    Tuesday
10 2024-01-31  Wednesday
11 2024-02-01   Thursday

Question 12

In [48]:
df = pd.DataFrame({
    'Date': pd.to_datetime(['2023-01-01 12:30:00', '2023-01-15 14:45:00', '2023-01-20 09:00:00', '2023-02-05 18:20:00']),
}) # create dataframe 
def select_rows_in_date_range(df, start_date='2023-01-01', end_date='2023-01-31'): # Create Function to select rows between '2023-01-01' and '2023-01-31'
    df['Date'] = pd.to_datetime(df['Date']) # Convert 'Date' column to datetime objects
    selected_rows = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]  # Filter rows based on the date range
    return selected_rows

selected_rows = select_rows_in_date_range(df, start_date='2023-01-01', end_date='2023-01-31') # Call the function to select rows
print(selected_rows)

                 Date
0 2023-01-01 12:30:00
1 2023-01-15 14:45:00
2 2023-01-20 09:00:00

Question 13

To use the basic functions of pandas, the first and foremost necessary library that needs to be imported is **pandas**.